app/views/users/show.html.erb

<h1>Organizations:</h1>
<% @user.organizations.each do |org| %>
---
SELECT "organizations".* FROM "organizations" INNER JOIN "subscriptions" ON "organizations"."id" = "subscriptions"."organization_id" WHERE "subscriptions"."user_id" = 1