app/controllers/organizations_controller.rb

  def create
    @organization = Organization.new(params[:organization])
    @organization.users << current_user
---
INSERT INTO "organizations" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 28 Oct 2013 00:19:03 UTC +00:00], ["description", nil], ["name", nil], ["updated_at", Mon, 28 Oct 2013 00:19:03 UTC +00:00]]

  def show
    @organization = Organization.find(params[:id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT 1  [["id", "foo_bar"]]

  def add_user
    new_user = User.find_by_email(params[:user_email])

    if new_user.nil?
      flash[:alert] = 'That user does not exist!'
    elsif @organization.users.include?(new_user)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'admin_c@admin' LIMIT 1
SELECT 1 AS one FROM "users" INNER JOIN "subscriptions" ON "users"."id" = "subscriptions"."user_id" WHERE "subscriptions"."organization_id" = 1 AND "users"."id" = 1 LIMIT 1