app/views/organizations/show.html.erb

    <ul>
      <% @organization.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "subscriptions" ON "users"."id" = "subscriptions"."user_id" WHERE "subscriptions"."organization_id" = 5